app/Http/Controllers/SyncController.php

select * from `users` where `online` = 1 and `offline` = 0
select * from `enregs` where `online` = 1 and `offline` = 0
---
    public function getData()
    {
        $users =  DB::table('users')
                    ->select('users.*','roles.name As role')
                    ->join('model_has_roles','model_has_roles.model_id','=','users.id')
                    ->join('roles','model_has_roles.role_id','=','roles.id')
                    ->where('online',1)
                    ->where('offline',0)
                    ->get();

                    $enregs = DB::table('enregs')->where('online',1)
                    ->where('offline',0)
                    ->get();

update `users` set `name` = 'Tech SARL', `email` = 'tech@example.bf', `contact` = '0000000', `statut` = 1, `email_verified_at` = '', `password` = '$2y$12$27HtE1HJMAh7gZRPnsXVCua6SeLkugud7QmJpdQjNfOgeakyVQDaa', `remember_token` = '', `online` = 1, `offline` = 1, `created_at` = '2024-04-03 11:58:34', `updated_at` = '2024-04-03 11:58:34' where (`id` = 5) limit 1
insert into `users` (`id`, `name`, `email`, `contact`, `statut`, `email_verified_at`, `password`, `remember_token`, `online`, `offline`, `created_at`, `updated_at`) values (5, 'Tech SARL', 'tech@example.bf', '0000000', 1, '', '$2y$12$27HtE1HJMAh7gZRPnsXVCua6SeLkugud7QmJpdQjNfOgeakyVQDaa', '', 0, 1, '2024-04-03 11:58:34', '2024-04-03 11:58:34')
---
    public function postData(Request $request)
    {


        $jsonData = $request->all();

        // return $jsonData;

        try {
            if ($jsonData && $jsonData['status'] === 'success') {
                $users = $jsonData['data']['users'];
                $enregs = $jsonData['data']['enregs'];

                // return array('status' => 'success');

                // return array('status' => $users);

                if (count($users) > 0) {
                    foreach ($users as $user) {
                        // return array('status' => $user);
                        $id = $user['id'];
                        $role = $user['role'];
                        unset($user['id']);
                        unset($user['role']);
                        $user['online'] = 1;
                        $user['offline'] = 1;
                        DB::table('users')->updateOrInsert(['id' => $id], $user);